{
  "backend/main.mo": "Main Motoko actor that manages chat sessions, user profiles, and file storage with role-based access control; exposes CRUD operations for sessions and messages, guarded by an `isReady` initialization flag.",
  "feature_evidence.json": "Feature evidence report mapping the 'actor not available to start' fix to the frontend files it touches and the components/test IDs it satisfies.",
  "frontend-file-summaries.txt": "JSON dictionary of short descriptions for every frontend source file, used as a build-planning reference for the project's UI components, pages, hooks, and styles.",
  "frontend/index.css": "Global dark-theme stylesheet defining OKLCH color tokens (indigo/cyan palette), typography imports (Space Grotesk, Inter, JetBrains Mono), glassmorphism utilities, glow effects, and animation keyframes.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a `#root` div and loads `src/main.tsx` as an ES module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with four routes (`/`, `/sessions`, `/sessions/new`, `/sessions/$sessionId`), wraps everything in `ActorGuard`, and provides QueryClient, ThemeProvider, and Toaster.",
  "frontend/src/components/ActorGuard.tsx": "Component that blocks rendering until the backend actor is available and `initialize()` succeeds, showing branded loading/error states and treating 'already initialized' or 'Unauthorized' responses as ready.",
  "frontend/src/components/CodeBlock.tsx": "Mac-style code block UI with terminal traffic-light chrome, a filename/language label, monospace syntax display, and a clipboard copy button with a 2-second confirmation state.",
  "frontend/src/components/LivePreview.tsx": "Renders an HTML string inside an iframe with viewport size controls (desktop/tablet/mobile), refresh, and open-in-new-tab functionality using blob URLs.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing loading state and clearing React Query cache on auth changes.",
  "frontend/src/components/Logo.tsx": "Displays the Noventra.ai brand logo with an animated SVG flame icon and gradient wordmark, supporting small and large size variants.",
  "frontend/src/components/MessageBubble.tsx": "Renders a chat message bubble that parses content into text and code block segments, and shows a live preview button when HTML code blocks are detected.",
  "frontend/src/components/ProfileSetup.tsx": "A modal overlay form that prompts new users to enter their name and saves it via the saveCallerUserProfile mutation to complete profile setup.",
  "frontend/src/components/ShareButton.tsx": "A button that copies the current page URL to the clipboard and shows a toast notification with a temporary 'Copied!' state.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor interactions including user profile CRUD, session management (get/create/delete), and message/file mutations with cache invalidation.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind, defining CSS custom properties for the dark theme color system, and utility component classes like glass, glow, gradient-text, and button styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/ChatPage.tsx": "Chat interface page that loads a session, sends user messages to an LLM, extracts generated HTML, persists messages and files to the backend, and displays a live preview alongside the conversation.",
  "frontend/src/pages/Home.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page showcasing features, stats, and CTAs with hero section, feature grid, and authentication-aware navigation to session creation.",
  "frontend/src/pages/NewSessionPage.tsx": "Form page for creating a new AI session, allowing the user to enter a project name and select a project type before navigating to the generated session's chat page.",
  "frontend/src/pages/SessionsPage.tsx": "Displays a list of user sessions as cards with project type icons, timestamps, and message counts, supporting navigation to individual sessions and deletion with loading/error states.",
  "frontend/src/services/llmService.ts": "Provides AI response generation via OpenRouter API, constructing system prompts based on project type and handling both initial generation and modification of existing HTML applications.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings and hash-based routes, with sessionStorage persistence helpers and hash cleanup functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark-themed design system with custom oklch colors, brand/cyan palette, glass shadows, glow effects, and Space Grotesk/JetBrains Mono fonts.",
  "project_state.json": "Project state metadata tracking version, existing features, and known issues—currently focused on fixing an 'actor not available to start' error in the backend actor initialization flow."
}