{
  "backend/main.mo": "Main Motoko actor for the ICP backend that manages user profiles and chat sessions, with access control via mixins for authorization and blob storage. Exposes query/update methods for CRUD operations on sessions and user profiles.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file, serving as a reference index for the project's frontend components, hooks, pages, and configuration files.",
  "frontend/index.css": "Global dark theme CSS for Noventra.Ai using OKLCH color tokens with indigo/cyan palette, Space Grotesk/Inter/JetBrains Mono fonts, glassmorphism utilities, glow effects, and animation keyframes.",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app that mounts the React root into a div and loads the main TSX module.",
  "frontend/src/App.tsx": "Root React app component that sets up QueryClient, ThemeProvider, ActorGuard, TanStack Router with four routes (home, sessions, new session, chat), and a profile setup guard in the AppLayout with global AudioContext initialization.",
  "frontend/src/components/AccentSelector.tsx": "UI component for selecting and previewing speech synthesis accents across 16 language/region groups, with play/stop controls and pitch/rate modifiers using the useSpeechSynthesis hook.",
  "frontend/src/components/ActorGuard.tsx": "Loading gate component that blocks rendering until the ICP actor is available, showing animated dots and cycling status messages, with a retry button after a 4-second timeout.",
  "frontend/src/components/AlarmNotification.tsx": "A modal overlay component that displays an alarm message and attempts to play an alarm sound, handling browser audio autoplay restrictions by prompting the user to enable audio manually.",
  "frontend/src/components/ApiKeySetup.tsx": "A form component for entering, saving, and clearing an OpenRouter API key, with validation, masked display of the current key, and optional modal layout.",
  "frontend/src/components/AudioEnablePrompt.tsx": "A bottom-bar prompt that listens for any user click to resume the AudioContext and enable alarm sounds, dismissible via an X button.",
  "frontend/src/components/AudioTuningPanel.tsx": "A panel of sliders and preset buttons for adjusting audio parameters (pitch, speed, volume, reverb, echo, etc.) using the AudioTuningParams interface.",
  "frontend/src/components/CodeBlock.tsx": "A styled code display component with a macOS-style header, syntax language label, and a copy-to-clipboard button with confirmation feedback.",
  "frontend/src/components/GesturePadGrid.tsx": "A 4x4 grid of trigger pads that play synthesized sounds via keyboard shortcuts or clicks, with an edit mode that opens a per-pad configuration modal.",
  "frontend/src/components/LivePreview.tsx": "An iframe-based live HTML preview component with desktop/tablet/mobile viewport switching that sanitizes the HTML by injecting polyfills to suppress dialogs and handle missing audio files gracefully.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity authentication, showing a loading spinner while connecting and clearing the React Query cache on logout.",
  "frontend/src/components/Logo.tsx": "Displays the Noventra.ai brand logo with an SVG flame icon and gradient text, supporting small and large size variants.",
  "frontend/src/components/MessageBubble.tsx": "Renders a chat message bubble for user, AI, or error messages, parsing content to split inline code blocks into syntax-highlighted CodeBlock components.",
  "frontend/src/components/PadConfigModal.tsx": "A dialog modal for configuring a drum pad's label, color, assigned sound, and keyboard shortcut, with an embedded sound picker sub-modal.",
  "frontend/src/components/ProfileSetup.tsx": "A full-screen overlay form that collects a new user's display name and saves it via the backend profile mutation before completing onboarding.",
  "frontend/src/components/ShareButton.tsx": "A button that copies a shareable session URL to the clipboard and briefly shows a confirmation checkmark after copying.",
  "frontend/src/components/SoundLibrary.tsx": "Displays a categorized, filterable grid of sound entries with play/stop preview controls and selection highlighting, using the Web Audio engine for playback.",
  "frontend/src/components/SoundPickerModal.tsx": "A modal dialog component that lets users browse, search, filter by category, preview, and select sounds from the sound library.",
  "frontend/src/components/WaveformVisualizer.tsx": "A canvas-based component that renders a real-time animated waveform using an AnalyserNode, with a gradient and glow effect, or a flat line when inactive.",
  "frontend/src/data/audioPresets.ts": "Defines the AudioTuningParams interface and exports a set of named audio effect presets (e.g., Robot, Underwater, Echo Chamber) with default parameter values.",
  "frontend/src/data/soundLibrary.ts": "Defines types and a large static library of synthesized sound entries organized by category (voices, animals, nature, etc.), each with synthesis parameters.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous Internet Computer actor using the current identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAlarmSound.ts": "A React hook that manages a shared AudioContext singleton and provides play/stop controls for a repeating two-beep alarm pattern using the Web Audio API.",
  "frontend/src/hooks/useAudioContextInit.ts": "A React hook that initializes and resumes the shared AudioContext on the first user interaction event, intended for use at the app root level.",
  "frontend/src/hooks/useAudioEngine.ts": "Provides a React hook that wraps a shared Web Audio API context to play synthesized sounds with noise buffers, reverb, and distortion effects based on SynthParams and AudioTuningParams. Exposes playSound, stopAll, and resumeContext methods.",
  "frontend/src/hooks/useAudioRecorder.ts": "React hook for recording microphone audio using MediaRecorder and Web Audio API, tracking recording state, elapsed time, permission status, and an analyser node. Exposes start, stop, export, and clear controls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook using DFINITY's AuthClient, managing login status, identity persistence, and delegation validity. Exports InternetIdentityProvider and useInternetIdentity.",
  "frontend/src/hooks/useKeyboardShortcuts.ts": "React hook that registers global keydown listeners mapped to callback functions, ignoring events fired from input elements. Shortcuts are kept current via a ref to avoid stale closures.",
  "frontend/src/hooks/usePresetStorage.ts": "React hook for persisting and managing named studio presets (tuning, voice, pad configs) in localStorage. Exposes save, load, delete, rename, and list operations.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data (user profiles, sessions) via a canister actor, with session-expiry error detection and retry logic. Includes a custom SessionExpiredError class.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "React hook wrapping the Web Speech API's SpeechSynthesis interface to load available voices, speak text with configurable rate and pitch, and track speaking state. Exposes speak, stop, and voice selection controls.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind layers, and defines a dark amber/orange design system with CSS custom properties, component utilities (glass-card, btn-primary, gradient-text), and scrollbar styles.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/ChatPage.tsx": "Full-featured chat page that loads a session, sends user messages to an LLM, displays message bubbles with a live HTML preview, and handles alarm detection, API key configuration, and error states.",
  "frontend/src/pages/Home.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page with a hero section, feature highlights, and project-type badges; handles Internet Identity login and redirects authenticated users to the sessions list.",
  "frontend/src/pages/NewSessionPage.tsx": "Form page for creating a new AI session, allowing the user to enter a project name and select from six project type presets before navigating to the resulting chat session.",
  "frontend/src/pages/SessionsPage.tsx": "Displays a grid of the user's existing sessions as cards with type icons, message counts, and relative timestamps, supporting navigation to a session and deletion with optimistic UI.",
  "frontend/src/services/llmService.ts": "Manages OpenRouter API key storage and provides a `generateAIResponse` function that sends chat messages to the OpenRouter API, returning raw and extracted HTML content. Also includes helpers for parsing HTML from AI responses and mapping HTTP error codes to user-friendly messages.",
  "frontend/src/utils/audioExport.ts": "Converts an `AudioBuffer` to a WAV `Blob` by writing a PCM WAV header and interleaved 16-bit samples, and provides a `downloadBlob` helper that triggers a browser file download.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters from both standard and hash-based routes, persisting them in `sessionStorage`, and cleaning sensitive parameters from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that extends the theme with OKLCH-based semantic color tokens, custom font families, border radii, box shadows, and keyframe animations, while enabling the animate, typography, and container-queries plugins.",
  "project_state.json": "Tracks the current build plan for the Noventra Sound Studio project, listing five pending architectural requirements to create a Sound Studio hub page integrating sound library, recording, preset management, and shared AudioContext features."
}