{
  "backend/main.mo": "Main Motoko actor implementing session management, user profiles, and access control with admin-gated initialization; includes CRUD operations for chat sessions with messages and files.",
  "backend/migration.mo": "Minimal migration module that defines an Actor type with an `isReady` flag and a no-op `run` function that returns the old state unchanged.",
  "feature_evidence.json": "Feature evidence report documenting the fix for the ActorGuard component getting stuck in a loading state, listing the affected file and related components.",
  "frontend-file-summaries.txt": "Pre-generated JSON summaries of all frontend source files describing their purpose, themes, and key implementation details for build planning reference.",
  "frontend/index.css": "Global dark theme CSS defining OKLCH color tokens for an indigo/cyan palette, glassmorphism utilities, glow effects, and font imports for Space Grotesk, Inter, and JetBrains Mono.",
  "frontend/index.html": "Minimal HTML entry point for the Noventra.Ai Vite/React app that mounts the React root and loads the main TSX module.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with session routes, QueryClientProvider, dark ThemeProvider, and wraps everything in ActorGuard to block rendering until the backend is initialized.",
  "frontend/src/components/ActorGuard.tsx": "Guard component that checks backend readiness via `getReadyStatus` and `initialize`, treating 'already initialized' and 'Unauthorized' errors as ready states, with a 30-second timeout and retry UI to prevent perpetual loading.",
  "frontend/src/components/CodeBlock.tsx": "Mac-style code block component with terminal chrome (traffic light dots), a filename/language label, syntax-highlighted code display in JetBrains Mono, and a clipboard copy button.",
  "frontend/src/components/LivePreview.tsx": "Renders an HTML string inside an iframe with viewport size controls (desktop/tablet/mobile), a refresh button, and an open-in-new-tab button using blob URLs.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing loading state and clearing the React Query cache on logout.",
  "frontend/src/components/Logo.tsx": "Displays the Noventra.ai brand logo with an animated SVG flame icon and a styled wordmark, supporting small and large size variants.",
  "frontend/src/components/MessageBubble.tsx": "Renders a chat message bubble that parses content into text and fenced code blocks, and shows a live preview button when the message contains an HTML code block.",
  "frontend/src/components/ProfileSetup.tsx": "A modal overlay form that prompts a newly authenticated user to enter their name and saves it via the useSaveCallerUserProfile mutation.",
  "frontend/src/components/ShareButton.tsx": "A button that copies the current page URL to the clipboard and shows a toast notification with a temporary 'Copied!' state.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor interactions including user profile CRUD, session management (get/create/delete), and message/file mutations with cache invalidation.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind, defining CSS custom properties for the dark theme color system, and utility component classes like glass, glow, gradient-text, and button styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/ChatPage.tsx": "Chat interface page that loads a session, sends user messages to an LLM, extracts generated HTML, persists messages and files to the backend, and displays a live preview alongside the conversation.",
  "frontend/src/pages/Home.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page showcasing features, stats, and CTAs with a hero section, feature grid, and authentication-aware navigation to start a new session.",
  "frontend/src/pages/NewSessionPage.tsx": "Form page for creating a new project session, allowing the user to enter a name and select a project type (landing, fullstack, mobile, API) before navigating to the chat page.",
  "frontend/src/pages/SessionsPage.tsx": "Displays a list of user sessions as cards with project type icons, timestamps, and message counts, supporting navigation to individual sessions and deletion with loading/error states.",
  "frontend/src/services/llmService.ts": "Provides AI response generation via OpenRouter API, building system prompts per project type and handling both initial generation and modification of existing HTML applications.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings and hash-based routes, with sessionStorage persistence helpers and hash cleanup functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark-themed design system with custom oklch colors, brand/cyan palettes, glass shadows, and animations like flame-flicker and pulse-glow.",
  "project_state.json": "Tracks project state at version 3, recording a known issue where the app gets stuck on a 'system not ready yet' message and listing a pending backend fix request for actor initialization logic."
}