{
  "backend/main.mo": "Main actor for the Noventra.Ai backend, implementing session management (create, list, get, delete), message/file storage per session, and user profile CRUD with role-based access control via AccessControl mixin.",
  "backend/migration.mo": "Defines shared data types (SessionData, Message, FileData) and a no-op migration function that passes actor state through unchanged.",
  "feature_evidence.json": "Feature evidence report mapping two high-confidence features (full app rebuild and dark theme preservation) to their relevant frontend files and component dependencies.",
  "frontend-file-summaries.txt": "JSON dictionary of short descriptions for each frontend source file, serving as a reference summary of every component, page, hook, and service in the frontend.",
  "frontend/index.css": "Global CSS file defining Noventra.Ai's dark theme with OKLCH color tokens, Space Grotesk/Inter/JetBrains Mono font imports, glassmorphism utilities, glow effects, and animation keyframes.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with Home, Sessions, NewSession, and Chat routes, wraps the app in QueryClientProvider and ThemeProvider, and renders the ProfileSetup modal globally.",
  "frontend/src/components/CodeBlock.tsx": "Renders a Mac-style terminal code block with traffic-light chrome, filename/language label, JetBrains Mono syntax display, and a clipboard copy button.",
  "frontend/src/components/LivePreview.tsx": "Iframe-based live HTML preview component with desktop/tablet/mobile viewport controls, a refresh button, and an open-in-new-tab action.",
  "frontend/src/components/LoginButton.tsx": "A React button component that handles Internet Identity login/logout, supporting both compact and full display modes with loading states.",
  "frontend/src/components/MessageBubble.tsx": "Renders a chat message bubble for user or assistant roles, parsing content into text and code block segments with optional HTML live preview.",
  "frontend/src/components/ProfileSetup.tsx": "A modal component that prompts authenticated users without a profile to enter their name, saving it via the backend mutation hook.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile, sessions, messages, and file operations using the actor from useActor.",
  "frontend/src/index.css": "Defines the global dark theme using OKLCH CSS variables, Tailwind imports, and reusable component classes like glassmorphism, gradient text, glow effects, and buttons for the Noventra.Ai app.",
  "frontend/src/main.tsx": "React app entry point that wraps the app with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/ChatPage.tsx": "Chat interface page for a session that handles sending messages, generating AI responses, persisting messages to the backend, and displaying a live HTML preview tab.",
  "frontend/src/pages/Home.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page for Noventra.Ai featuring a hero section, feature highlights, stats, and login/navigation controls.",
  "frontend/src/pages/NewSessionPage.tsx": "Form page for creating a new AI session, allowing users to enter a project name and select a project type before navigating to the chat.",
  "frontend/src/pages/SessionsPage.tsx": "Dashboard page that lists all user sessions with project type icons, relative timestamps, and the ability to delete or open sessions.",
  "frontend/src/services/llmService.ts": "Defines TypeScript interfaces for AI-generated files and responses, and provides scaffold-building functions that generate HTML/CSS landing page boilerplate based on project type and name.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and cleaning URL parameters from both query strings and hash-based routes, using sessionStorage for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark-themed design system with OKLCH color tokens, custom typography (Inter, Space Grotesk, JetBrains Mono), glow box shadows, and animation keyframes.",
  "project_state.json": "Tracks the Noventra AI project's state including version, architectural notes about ICP canister deployment issues, known bugs, and existing features for a landing page generator app with chat and live preview."
}