{
  "backend/main.mo": "Main Motoko actor that manages chat sessions and user profiles, mixing in blob storage and authorization modules. Provides CRUD operations for sessions (with messages and files) and user profiles, enforcing access control via role-based permissions.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—ActorGuard startup optimization and ChatPage 401 error handling improvements—to their respective source files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, serving as a reference index for the project's frontend codebase.",
  "frontend/index.css": "Global dark-theme stylesheet defining OKLCH color tokens for an indigo/cyan palette, glassmorphism utilities, glow effects, and imports for Space Grotesk, Inter, and JetBrains Mono fonts via Tailwind layers.",
  "frontend/index.html": "Minimal HTML entry point for the Noventra.Ai Vite/React app, mounting the React root into a `#root` div and loading `src/main.tsx` as a module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for home, sessions list, new session, and chat pages, wrapped in QueryClientProvider, ThemeProvider (dark), and ActorGuard.",
  "frontend/src/components/ActorGuard.tsx": "Initialization gate component that shows a branded loading spinner while the backend actor connects, proceeds automatically after an 8-second hard timeout, and renders an error state with a retry button if needed.",
  "frontend/src/components/CodeBlock.tsx": "Styled code display component with a macOS-style terminal chrome header (traffic-light dots, filename label) and a clipboard copy button that toggles to a 'Copied!' confirmation state.",
  "frontend/src/components/LivePreview.tsx": "Renders an HTML string inside an iframe with viewport size controls (desktop/tablet/mobile), refresh, and open-in-new-tab functionality using blob URLs.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing loading state and clearing the React Query cache on logout.",
  "frontend/src/components/Logo.tsx": "Displays the Noventra.ai brand logo with an animated SVG flame icon and gradient wordmark, supporting small and large size variants.",
  "frontend/src/components/MessageBubble.tsx": "Renders a chat message bubble that parses content into text and code block segments, and shows a live preview button when HTML code is detected in assistant messages.",
  "frontend/src/components/ProfileSetup.tsx": "A modal form for new users to enter their display name and save their profile, with user-friendly error handling for common backend failures.",
  "frontend/src/components/ShareButton.tsx": "A button that copies the current page URL to the clipboard and shows a toast notification with a brief copied confirmation state.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data (user profiles, sessions, messages, files), with a custom SessionExpiredError class and error parsing logic to handle 401/session-expired scenarios.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind base/components/utilities, and defines CSS custom properties and reusable component classes (glass cards, glow effects, gradient text, buttons) using OKLCH color tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/ChatPage.tsx": "Chat interface page that loads a session, displays messages, handles AI response generation, updates HTML preview files, and shows session-expired or generic error banners with retry/logout actions.",
  "frontend/src/pages/Home.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page showcasing Noventra.ai features, stats, and CTAs, with hero section, feature grid, and login/navigation buttons for authenticated and unauthenticated users.",
  "frontend/src/pages/NewSessionPage.tsx": "Form page for creating a new project session, allowing the user to enter a project name and select a project type (landing, fullstack, mobile, API) before navigating to the created session.",
  "frontend/src/pages/SessionsPage.tsx": "Displays a list of user chat sessions as cards with project type icons, timestamps, and delete functionality. Handles loading, error, and unauthenticated states.",
  "frontend/src/services/llmService.ts": "Calls the OpenRouter API to generate AI responses for different project types, using tailored system prompts for new generation or modification of existing HTML applications.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters (including hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark-themed design system with custom OKLCH colors, fonts, shadows, border radii, and keyframe animations for the Noventra.ai frontend.",
  "project_state.json": "Tracks the current state of the Noventra.ai project, recording known issues (API 401 errors and ~2-minute startup time) and pending fix requests for error handling and initialization optimization."
}