{
  "backend/main.mo": "Main ICP actor that manages user profiles and chat sessions, with access control via MixinAuthorization and blob storage via MixinStorage. Exposes query/update methods for CRUD on sessions and user profiles, enforcing caller-based authorization.",
  "feature_evidence.json": "Feature evidence report listing three features related to fixing app startup/launch issues, TanStack Router route setup, and backend actor reachability, each mapped to relevant files, components, and test IDs.",
  "frontend-file-summaries.txt": "A JSON document containing one-sentence summaries of all frontend source files, describing their purpose, styling approach, and notable fixes or behaviors.",
  "frontend/index.css": "Global dark-theme CSS for Noventra.Ai using OKLCH color tokens for an indigo/cyan palette, glassmorphism utilities, glow effects, and imports for Space Grotesk, Inter, and JetBrains Mono fonts.",
  "frontend/index.html": "Minimal HTML entry point for the Noventra.Ai frontend, mounting the React app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React app that sets up QueryClient, ThemeProvider, ActorGuard, and TanStack Router with four routes; AppLayout conditionally renders ProfileSetup only when the user is authenticated and has no profile after fetching.",
  "frontend/src/components/AccentSelector.tsx": "UI component for browsing and previewing speech synthesis voices grouped by language/region, with play/stop controls and pitch/rate modifiers using the useSpeechSynthesis hook.",
  "frontend/src/components/ActorGuard.tsx": "A loading gate component that shows a spinner with cycling status messages while the ICP actor initializes, and displays a timeout/retry screen if the backend takes more than 8 seconds to respond.",
  "frontend/src/components/AlarmNotification.tsx": "A full-screen modal alarm notification that plays an audio alarm on mount, handles browser autoplay restrictions with a user-gesture prompt, and provides dismiss/mute controls.",
  "frontend/src/components/ApiKeySetup.tsx": "A form component for entering, saving, and removing an OpenRouter API key, with validation, masked display of the current key, and optional modal layout.",
  "frontend/src/components/AudioEnablePrompt.tsx": "A bottom-bar prompt that listens for any user click to resume the AudioContext and enable alarm sounds, then notifies the parent via callbacks.",
  "frontend/src/components/AudioTuningPanel.tsx": "A panel of sliders for tuning audio parameters (pitch, speed, volume, reverb, echo, etc.) with preset buttons and a reset-all option.",
  "frontend/src/components/CodeBlock.tsx": "A styled code display component with a macOS-style header, language/filename label, and a copy-to-clipboard button with a brief confirmation state.",
  "frontend/src/components/GesturePadGrid.tsx": "A 4×4 grid of trigger pads that play synthesized sounds via keyboard shortcuts or clicks, with per-pad color, label, and sound configuration accessible in edit mode.",
  "frontend/src/components/LivePreview.tsx": "Renders an HTML live preview inside an iframe with desktop/tablet/mobile viewport modes, injecting a polyfill script that suppresses dialogs, stubs file-based Audio with a Web Audio beep fallback, and handles media element errors.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component that uses Internet Identity authentication, showing a loading spinner during login and toggling between login and logout states.",
  "frontend/src/components/Logo.tsx": "Renders the Noventra.ai brand logo with an SVG flame icon and gradient text, supporting small and large size variants.",
  "frontend/src/components/MessageBubble.tsx": "Displays a chat message bubble for user, assistant, or error messages, parsing content to render mixed text and syntax-highlighted code blocks.",
  "frontend/src/components/PadConfigModal.tsx": "Modal dialog for configuring a drum pad's label, color, sound (via a nested SoundPickerModal), and keyboard shortcut with key-capture support.",
  "frontend/src/components/ProfileSetup.tsx": "Full-screen onboarding overlay that prompts a newly authenticated user to enter their display name and saves it via the backend profile mutation.",
  "frontend/src/components/ShareButton.tsx": "Button that copies a shareable session URL to the clipboard and briefly shows a confirmation checkmark after copying.",
  "frontend/src/components/SoundLibrary.tsx": "A React component that displays a categorized, browsable sound library with color-coded category filters and a scrollable grid of sounds that can be previewed via play/stop buttons or selected via callback.",
  "frontend/src/components/SoundPickerModal.tsx": "A modal dialog for searching and selecting sounds from the library, featuring a text search input, category tab filters, and a scrollable grid of results.",
  "frontend/src/components/WaveformVisualizer.tsx": "A canvas-based waveform visualizer that animates real-time audio data from a Web Audio AnalyserNode, drawing a gradient waveform with a glow effect or a flat idle line.",
  "frontend/src/data/audioPresets.ts": "Defines the AudioTuningParams interface and exports a set of named audio effect presets (e.g., Robot, Underwater, Echo Chamber) with default parameter values for pitch, reverb, EQ, compression, and more.",
  "frontend/src/data/soundLibrary.ts": "Defines TypeScript types for sound entries and synth parameters, and exports a large SOUND_LIBRARY array of synthesized sounds organized into categories like Human Voices, Animal Sounds, and Game & UI SFX.",
  "frontend/src/hooks/useActor.ts": "A custom React hook that creates and caches an authenticated or anonymous Internet Computer actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAlarmSound.ts": "Provides a React hook for playing and stopping a repeating beep alarm using the Web Audio API, with a shared AudioContext singleton and utilities to create/resume it.",
  "frontend/src/hooks/useAudioContextInit.ts": "Initializes and resumes the shared AudioContext on the first user interaction (click, keydown, etc.), intended for use at the App level to ensure audio is ready before alarms fire.",
  "frontend/src/hooks/useAudioEngine.ts": "Provides a React hook exposing a low-level audio engine that synthesizes sounds (oscillators, noise, reverb, distortion) using the Web Audio API based on SynthParams and AudioTuningParams.",
  "frontend/src/hooks/useAudioRecorder.ts": "React hook that manages microphone recording via MediaRecorder, tracking recording state, elapsed time, permission status, and providing start/stop/export/clear controls along with an AnalyserNode.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using @dfinity/auth-client, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useKeyboardShortcuts.ts": "React hook that registers global keydown listeners for a map of keyboard shortcuts, ignoring events when focus is in input or editable elements.",
  "frontend/src/hooks/usePresetStorage.ts": "React hook for persisting and managing named studio presets (audio tuning, pad configs, voice) in localStorage, with save, load, delete, rename, and list operations.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data (user profiles, sessions, messages) via an actor, with session-expiry error handling.",
  "frontend/src/hooks/useSpeechSynthesis.ts": "Custom React hook that wraps the Web Speech Synthesis API, providing voice loading, voice selection, speak/stop controls, and speaking state tracking.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind layers, defines a dark amber/orange CSS custom property palette, and provides utility classes for glass cards, gradient buttons, glow effects, and thin scrollbars.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/ChatPage.tsx": "Full chat interface page that loads a session, sends user messages, streams AI-generated HTML responses, renders a live preview, and handles alarms, API key configuration, and error states.",
  "frontend/src/pages/Home.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page with a hero section, feature highlights, and project type badges; handles Internet Identity login and redirects authenticated users to the sessions list.",
  "frontend/src/pages/NewSessionPage.tsx": "Page for creating a new AI session, allowing users to enter a project name and select a project type (landing page, dashboard, game, etc.) before navigating to the new chat session.",
  "frontend/src/pages/SessionsPage.tsx": "Page that lists all user sessions as cards with project type icons, message counts, and timestamps, supporting navigation to a session or deletion of a session.",
  "frontend/src/services/llmService.ts": "Manages OpenRouter API key storage (localStorage) and provides functions to call the OpenRouter chat completions API, map HTTP errors to user-friendly messages, and extract HTML content from AI responses.",
  "frontend/src/utils/audioExport.ts": "Converts a Web Audio API AudioBuffer to a WAV Blob by writing a PCM WAV header and interleaved 16-bit samples, and provides a helper to trigger a browser file download for any Blob.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL query parameters from both regular and hash-based routes, persisting them to sessionStorage, and cleaning sensitive parameters from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining a custom OKLCH-based color palette, typography/display/mono font families, extended border radii, box shadows, and custom keyframe animations (flame-flicker, fade-in, slide-up, bounce-dot).",
  "project_state.json": "Tracks the current state of the Noventra project, recording three existing fix-request features targeting app startup/launch issues, TanStack Router route resolution, and backend canister reachability on initialization."
}