{
  "backend/main.mo": "Motoko actor implementing a session management backend with CRUD operations for chat sessions, messages, and files, using a Map-based store with owner-based access control.",
  "feature_evidence.json": "Feature evidence report linking two landing page generation features to their relevant source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON map of frontend file paths to short descriptions summarizing the purpose and recent changes of each frontend source file.",
  "frontend/index.css": "Global CSS file defining Noventra.Ai's dark theme using OKLCH color tokens, glassmorphism utilities, glow effects, and imports for Space Grotesk, Inter, and JetBrains Mono fonts.",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app, mounting the React root at `#root` and loading `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for Home, Sessions, New Session, and Chat pages, plus a Sonner Toaster.",
  "frontend/src/components/CodeBlock.tsx": "Reusable code block component with macOS-style terminal chrome, filename/language label, and a clipboard copy button using JetBrains Mono.",
  "frontend/src/components/MessageBubble.tsx": "Chat message renderer that parses assistant responses for fenced code blocks and renders them via CodeBlock, with CSS-based slide-in animation on mount.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous ICP backend actor, invalidating dependent queries whenever the actor or identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP network, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on sessions and messages, including fetching, creating, deleting sessions, adding messages, and updating files via the backend actor.",
  "frontend/src/index.css": "Global stylesheet defining the dark theme design system with OKLCH color tokens, Tailwind base/utilities, custom glassmorphism classes, and typography using Space Grotesk, Inter, and JetBrains Mono fonts.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/ChatPage.tsx": "Chat interface page that displays session messages, handles user input, generates AI responses via llmService, and persists messages and generated files to the backend with optimistic UI updates.",
  "frontend/src/pages/Home.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page for Noventra.Ai showcasing features, stats, and navigation with animated background glows and fade-in effects.",
  "frontend/src/pages/NewSessionPage.tsx": "Page for creating a new coding session, allowing users to enter a project name and select from four project types before navigating to the chat interface.",
  "frontend/src/pages/SessionsPage.tsx": "Displays a list of past AI sessions as cards with project type icons, timestamps, and delete functionality, allowing users to navigate into or remove sessions.",
  "frontend/src/services/llmService.ts": "Defines TypeScript interfaces for AI-generated files and responses, and provides a hardcoded landing page HTML/CSS scaffold builder function for the Noventra.Ai project type flow.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH color tokens, typography/font families, border radii, and plugins for the Noventra.Ai dark-themed UI.",
  "project_state.json": "Tracks the current project state including existing implemented features (landing page scaffold and theme polish) and a pending new feature request to create a Noventra.Ai landing page."
}