{
  "backend/main.mo": "Main Motoko actor that manages user profiles and chat sessions, with access control via MixinAuthorization and blob storage via MixinStorage. Exposes CRUD endpoints for sessions (with messages and files) and user profiles, enforcing caller-based authorization.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (alarm sound system, audio context initialization guard, media element fixes) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "A JSON document containing one-line summaries of each frontend source file, serving as a reference index for the project's frontend components, hooks, pages, and styles.",
  "frontend/index.css": "Global CSS for the Noventra.Ai dark theme, defining OKLCH color tokens for an indigo/cyan palette, typography (Space Grotesk, Inter, JetBrains Mono), glassmorphism utilities, glow effects, and animation keyframes.",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app, mounting the React root into a div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root React app component that sets up QueryClient, ThemeProvider, ActorGuard, TanStack Router with four routes, and a global AudioContext initializer via useAudioContextInit; also handles the first-login profile setup modal.",
  "frontend/src/components/ActorGuard.tsx": "Loading/timeout guard component that blocks rendering children until the backend actor is available, showing an animated loading screen or a retry button after a 10-second timeout.",
  "frontend/src/components/AlarmNotification.tsx": "Modal overlay component that displays an alarm notification with a message, attempts to play an alarm sound on mount, and handles browser audio gesture restrictions with a prompt to enable sound manually.",
  "frontend/src/components/ApiKeySetup.tsx": "Form component for entering, saving, and removing an OpenRouter API key, with validation, masked display of the current key, and optional modal layout.",
  "frontend/src/components/AudioEnablePrompt.tsx": "Bottom-bar prompt that listens for any user click to resume the AudioContext and enable alarm sound, dismissible via an X button.",
  "frontend/src/components/CodeBlock.tsx": "Styled code block component with a macOS-style header showing language/filename and a copy-to-clipboard button with a confirmation state.",
  "frontend/src/components/LivePreview.tsx": "Renders generated HTML content inside a sandboxed iframe with desktop/tablet/mobile viewport toggles, injecting an error-handler script to gracefully handle broken media elements.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that triggers Internet Identity login or logout, showing a loading spinner during the login process and clearing the React Query cache on logout.",
  "frontend/src/components/Logo.tsx": "Renders the Noventra.ai brand logo with an SVG flame icon and gradient text, supporting small and large size variants.",
  "frontend/src/components/MessageBubble.tsx": "Chat message bubble component that renders user, AI, or error messages, parsing markdown-style code blocks into syntax-highlighted CodeBlock components for AI responses.",
  "frontend/src/components/ProfileSetup.tsx": "A modal form component that collects a user's display name on first login and saves it via the `useSaveCallerUserProfile` mutation, showing validation and error feedback.",
  "frontend/src/components/ShareButton.tsx": "A button component that copies a session's shareable URL to the clipboard and briefly shows a 'Copied!' confirmation state.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated (or anonymous) ICP backend actor, invalidating all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAlarmSound.ts": "A hook that manages a repeating two-beep alarm using the Web Audio API, exposing play/stop controls and audio-context readiness state via a shared AudioContext singleton.",
  "frontend/src/hooks/useAudioContextInit.ts": "An app-level hook that initializes and resumes the shared AudioContext on the first user interaction event, ensuring audio is ready before any alarm fires.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context (login, logout, identity, status) via a React context and AuthClient, with delegation validity checks and configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations (user profile, sessions CRUD), including a custom `SessionExpiredError` class and error-parsing logic for 401/not-found responses.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind layers, defines a dark amber/orange CSS custom property palette, and provides reusable component classes like glass-card, btn-primary, gradient-text, and glow utilities.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/ChatPage.tsx": "Full chat interface page that loads a session, sends user messages to an LLM service, displays message bubbles with a live HTML preview panel, and handles alarm notifications, API key errors, and retry logic.",
  "frontend/src/pages/Home.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page that showcases AI app-builder features, project type options, and a CTA button that either navigates authenticated users to sessions or triggers Internet Identity login.",
  "frontend/src/pages/NewSessionPage.tsx": "Form page for creating a new AI session, allowing users to enter a project name and select from six project type presets before navigating to the resulting chat session.",
  "frontend/src/pages/SessionsPage.tsx": "Sessions list page that displays all user sessions as cards with project type icons, message counts, and relative timestamps, supporting navigation to a session or deletion with confirmation.",
  "frontend/src/services/llmService.ts": "Provides OpenRouter API integration including API key management (localStorage), error mapping, HTML extraction from LLM responses, and a `generateAIResponse` function that sends chat messages with project-type-specific system prompts.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL parameters from both query strings and hash-based routes, with helpers to persist values in sessionStorage and clean sensitive params from the URL bar without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH-based design tokens, custom font families, border radii, box shadows, and keyframe animations, plus the animate, typography, and container-queries plugins.",
  "project_state.json": "Tracks the current project state for Noventra.ai (version 3), recording existing implemented features around Web Audio API alarm sound synthesis and known issues with alarm sound playback failures, with no new feature requests pending."
}