{
  "backend/main.mo": "Main Motoko actor that manages chat sessions, user profiles, and messages using mixins for blob storage and authorization. Exposes CRUD operations for sessions, messages, and files with access-control checks on every endpoint.",
  "feature_evidence.json": "Feature evidence report confirming removal of the 'Made by you'/'Made with AI' watermark branding from HomePage.tsx and llmService.ts with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, describing each file's purpose, theme, and key changes (e.g., red-orange brand palette, watermark removal, component updates).",
  "frontend/index.css": "Global CSS for the Noventra.Ai dark theme using OKLCH color tokens (indigo/cyan palette), Space Grotesk/Inter/JetBrains Mono fonts, glassmorphism utilities, glow effects, and animation keyframes.",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app, setting the page title to 'Noventra.Ai' and mounting the React root.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with Home, Sessions, NewSession, and Chat routes, wraps the app in QueryClientProvider and ThemeProvider, and conditionally renders the ProfileSetup modal.",
  "frontend/src/components/CodeBlock.tsx": "Reusable code display component with macOS-style terminal chrome (traffic-light dots), a filename/language label, syntax-highlighted monospace content, and a clipboard copy button.",
  "frontend/src/components/LivePreview.tsx": "Iframe-based live HTML preview component with desktop/tablet/mobile viewport switching, a refresh button, and an open-in-new-tab action using a Blob URL.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button that handles authentication state, shows a spinner during login, and clears the React Query cache on logout.",
  "frontend/src/components/Logo.tsx": "Renders the Noventra.ai logo with an animated SVG flame icon and a styled wordmark, supporting 'small' and 'large' size variants.",
  "frontend/src/components/MessageBubble.tsx": "Displays a chat message bubble for user or AI messages, parsing content into text and code block segments, with an optional live HTML preview button.",
  "frontend/src/components/ProfileSetup.tsx": "Modal form component that prompts new users to enter their name and saves it via the saveCallerUserProfile mutation to complete profile setup.",
  "frontend/src/components/ShareButton.tsx": "Button that copies the current page URL to the clipboard and shows a toast notification, toggling to a 'Copied!' state briefly after success.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing AuthClient creation, login, logout, and persisted identity state with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile CRUD, session management, message addition, and file updates.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, defines CSS custom properties for the dark theme design system, and declares reusable Tailwind component classes for glass effects, gradients, glows, and buttons.",
  "frontend/src/main.tsx": "Entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ChatPage.tsx": "Chat interface page that loads a session, displays messages, sends user input to an AI service, extracts generated HTML, and persists messages and files to the backend.",
  "frontend/src/pages/Home.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page showcasing Noventra.ai features, stats, and CTA buttons with login/navigation support.",
  "frontend/src/pages/NewSessionPage.tsx": "Form page for creating a new project session by entering a name and selecting a project type, then navigating to the chat page.",
  "frontend/src/pages/SessionsPage.tsx": "Displays a list of the user's sessions as cards with project type, timestamps, and message counts, supporting navigation and deletion.",
  "frontend/src/services/llmService.ts": "LLM service that generates AI responses and scaffolds HTML templates for different project types (landing, fullstack, mobile, API) based on user input and session context.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark-themed design system with custom OKLCH colors, fonts, border radii, shadows, and keyframe animations.",
  "project_state.json": "Project state metadata tracking an existing feature and a pending request, both related to removing 'Made with AI' branding from the app."
}