{
  "kind": "build_request",
  "title": "Fix session creation failure and remove localhost references from AI responses",
  "projectName": "Noventra.Ai",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Fix the 'Failed to create session. Please try again.' error on the New Session page. The createSession backend call is failing — audit the Motoko actor's createSession function and the frontend useQueries.ts hook that calls it to identify and resolve the mismatch (e.g. argument shape, principal handling, or stable variable initialization). The New Session form must successfully create a session and navigate to the Chat page without errors.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Failed to create session. Please try again."
        ]
      },
      "acceptanceCriteria": [
        "Submitting the New Session form with a project name and project type creates a session in the backend without throwing an error.",
        "After successful creation, the user is navigated to the Chat page for the new session.",
        "The error toast 'Failed to create session. Please try again.' no longer appears on valid submissions.",
        "Existing sessions are unaffected and still load correctly on the Sessions dashboard."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Remove all localhost URL references from the pre-built template responses in frontend/src/services/llmService.ts. Template responses must not instruct users to open localhost:5173 or any localhost/127.0.0.1 URL. Replace any such instructions with a note that the project is ready to use and the user can follow the Getting Started steps in their local environment, without mentioning a specific localhost address.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Open **http://localhost:5173** to see your landing page."
        ]
      },
      "acceptanceCriteria": [
        "No template response in llmService.ts contains the string 'localhost' or '127.0.0.1'.",
        "Getting Started instructions in generated responses remain helpful but do not reference a specific local URL.",
        "All four project type templates (fullstack, mobile, landing page, custom) are checked and cleaned."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Fix the navigation link on the Home landing page (HomePage.tsx) that redirects users to the Sessions page. The link must use the React Router path (/sessions) and must not contain any hardcoded localhost or absolute URL. Verify all CTA buttons ('Start New Project', 'My Sessions') route correctly within the deployed app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "asked me to go to landing page but it has local host error"
        ]
      },
      "acceptanceCriteria": [
        "Clicking 'My Sessions' in the navigation bar routes to /sessions without a localhost redirect.",
        "Clicking 'Start New Project' routes to /sessions/new without a localhost redirect.",
        "All navigation works correctly in the deployed Caffeine preview environment (not just localhost)."
      ]
    }
  ],
  "constraints": [
    "Do not change the Motoko backend data schema or stable variable structure.",
    "Do not modify any file under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Do not introduce any external API calls or live LLM integrations."
  ],
  "nonGoals": [
    "Adding new project types or template content.",
    "Changing the visual design or layout of any page.",
    "Modifying the Download All Files feature.",
    "Any changes to authentication or Internet Identity flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}