{
  "kind": "build_request",
  "title": "Fix alarm sound playback — configure audio support in Noventra",
  "projectName": "Noventra.ai",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a robust alarm sound system that uses the Web Audio API (AudioContext) as the primary sound engine to generate alarm tones programmatically, removing any dependency on external audio files or URLs that may fail to load. When an alarm triggers, synthesize a repeating beep/tone pattern using OscillatorNode so that sound playback works reliably without network requests or file permission issues.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "cannot get sound from the alarm continuesly giving error",
          "Noventra is not configured well for sounds and videos"
        ]
      },
      "acceptanceCriteria": [
        "When an alarm fires, an audible repeating tone plays immediately without throwing console errors.",
        "Sound is generated via Web Audio API (AudioContext + OscillatorNode) — no external audio file URLs are required.",
        "The alarm tone repeats on a timed interval until the user dismisses it.",
        "A user-visible 'Stop Alarm' / dismiss button halts the audio and clears the interval.",
        "No unhandled promise rejections or MediaError exceptions appear in the browser console during alarm playback."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a user-gesture-safe audio initialisation guard. The Web Audio API requires a user gesture before AudioContext can run. On the first user interaction after page load (click, keydown, or pointer event), resume or create the AudioContext so it is in the 'running' state before any alarm fires. Display an unobtrusive banner or toast prompting the user to interact with the page if the AudioContext is suspended when an alarm is about to trigger.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "continuesly giving error",
          "not configured well for sounds"
        ]
      },
      "acceptanceCriteria": [
        "AudioContext is created and resumed on the first user interaction on the page.",
        "If AudioContext is still suspended when an alarm fires, a toast message prompts 'Click anywhere to enable alarm sound' and the alarm visual indicator still activates.",
        "After the user interacts, subsequent alarms play sound without any additional prompts.",
        "No 'AudioContext was not allowed to start' browser warning appears after a user has interacted with the page."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Audit and fix any video/media elements in the frontend that may be misconfigured. Ensure all HTML5 video or audio elements include the correct MIME types and use local or blob sources where possible. Remove or replace any broken external media URLs. If the LivePreview sandbox iframe is involved in media playback errors, update its sandbox attribute to include 'allow-scripts allow-same-origin' and ensure media autoplay policies are respected.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Noventra is not configured well for sounds and videos"
        ]
      },
      "acceptanceCriteria": [
        "No MediaError or net::ERR_BLOCKED_BY_RESPONSE errors appear in the console related to audio or video elements.",
        "The LivePreview iframe sandbox attribute permits the media functionality it needs without exposing security risks.",
        "Any previously broken audio/video elements either display a graceful fallback or play correctly."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "All audio must be generated client-side via Web Audio API — do not add external CDN audio file dependencies.",
    "Backend (main.mo) should not be changed unless alarm data persistence is explicitly requested."
  ],
  "nonGoals": [
    "Adding new alarm creation UI — the existing alarm creation flow already works.",
    "Implementing video streaming or media upload features.",
    "Changing the overall visual theme or color system.",
    "Backend changes for alarm storage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}