{
  "kind": "build_request",
  "title": "Reduce app startup loading time and improve initialization performance",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Reduce the app startup/loading time from ~2 minutes to under 10 seconds. Optimize the ActorGuard initialization flow by reducing retry delays, lowering the hard timeout threshold, and ensuring the app proceeds to render as soon as the backend responds or a minimal viable connection is established. Avoid unnecessary sequential awaits during startup.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "loding time is more it takes 2 minuts to start"
        ]
      },
      "acceptanceCriteria": [
        "App loads and becomes interactive in under 10 seconds on a normal connection",
        "ActorGuard does not block the UI for more than 10 seconds under any condition",
        "Exponential backoff retry delays are capped at a low value (e.g., max 2 seconds per retry) to avoid long waits",
        "The hard timeout in ActorGuard is reduced to no more than 10 seconds",
        "Loading screen displays a meaningful progress indicator or status message so users know the app is starting"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Optimize backend initialization in main.mo to ensure the initialize() function returns quickly. Avoid blocking or expensive operations during initialization that could cause the frontend to wait.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "loding time is more it takes 2 minuts to start"
        ]
      },
      "acceptanceCriteria": [
        "The initialize() canister call completes within 2 seconds",
        "No heavy computation or blocking loops run during initialization"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve the error handling for API 401 'User not found' errors in the chat page. Instead of showing a raw red error banner, display a user-friendly message with a 'Retry' button that re-attempts the request, and a suggestion to log out and log back in if the error persists.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-api-error"
        ],
        "quotes": [
          "API error 401: User not found."
        ]
      },
      "acceptanceCriteria": [
        "401 API errors show a friendly message such as 'Session expired. Please try again or log out and log back in.'",
        "A 'Retry' button is displayed that re-sends the failed request",
        "A 'Logout' shortcut link is also shown in the error state",
        "Raw error text like 'API error 401: User not found' is no longer shown directly to the user"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "Do not change the backend's public API surface or data schema"
  ],
  "nonGoals": [
    "Fixing the underlying Caffeine platform API key or authentication token — that is a platform-level issue",
    "Adding new AI or LLM features",
    "Changing the visual design or branding"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}