{
  "kind": "build_request",
  "title": "Fix Noventra app startup/launch issues",
  "projectName": "Noventra",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Diagnose and fix the app startup/launch issues preventing Noventra from loading correctly. Investigate the ActorGuard initialization flow, ICP actor creation in useActor.ts, and the InternetIdentityProvider bootstrap sequence. Ensure the app mounts successfully without hanging, crashing, or showing a permanent loading state on first load.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Noventra has starting issues .. not fixed yet"
        ]
      },
      "acceptanceCriteria": [
        "The app loads and renders without hanging on the ActorGuard loading screen",
        "The ICP actor initializes successfully on page load (both authenticated and anonymous)",
        "No console errors related to actor initialization or identity provider on startup",
        "The home/landing page is reachable within a reasonable time after page load",
        "Retry mechanism in ActorGuard works correctly if actor initialization is slow"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Audit and fix the TanStack Router route setup in App.tsx to ensure all four routes (home, sessions, new session, chat) resolve correctly on initial navigation and hard refresh. Confirm the AppLayout profile setup guard does not block rendering in error states.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Noventra has starting issues .. not fixed yet"
        ]
      },
      "acceptanceCriteria": [
        "All four routes are accessible without 404 or blank screen on direct navigation",
        "Hard-refreshing any route loads the correct page",
        "The ProfileSetup guard only triggers when a profile is genuinely missing, not on every load",
        "No routing errors appear in the console on startup"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the backend actor (main.mo) is reachable on app startup. Verify the canister ID configuration and that anonymous/authenticated calls to query methods do not fail silently during initialization.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Noventra has starting issues .. not fixed yet"
        ]
      },
      "acceptanceCriteria": [
        "The frontend successfully connects to the backend canister on startup",
        "Canister ID is correctly resolved in both local and production environments",
        "Query calls made during initialization return valid responses or clear error messages"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "Preserve all existing route definitions and page components — only fix initialization/startup logic"
  ],
  "nonGoals": [
    "Adding new features or pages",
    "Changing the visual design or theme",
    "Modifying backend data models or canister logic beyond connectivity fixes"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}