{
  "kind": "build_request",
  "title": "Fix 'system not ready yet please wait' loading state",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the ActorGuard component so it does not get stuck showing a 'system not ready yet, please wait' message on load. The component should correctly detect when the backend actor is available and the initialize() call has succeeded (including treating 'already initialized' and 'Unauthorized' responses as ready states), then allow the app to render normally without remaining in a perpetual loading/waiting state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "its telling system not ready yet please wait"
        ]
      },
      "acceptanceCriteria": [
        "On page load, the app no longer stays stuck on 'system not ready yet please wait'",
        "ActorGuard transitions out of the loading state once the actor is available and initialize() resolves",
        "'Already initialized' and 'Unauthorized' responses from initialize() are treated as a ready state",
        "The main app UI renders after the guard clears successfully",
        "If the backend is genuinely unavailable, an appropriate error state is shown rather than an infinite wait"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Review the backend main.mo actor initialization logic to ensure the isReady flag is set correctly and that the initialize() function returns an appropriate response that the frontend can detect as a success. Ensure there are no race conditions or stuck states that would prevent the actor from becoming ready.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "its telling system not ready yet please wait"
        ]
      },
      "acceptanceCriteria": [
        "The isReady flag is set to true after initialization completes",
        "The initialize() function returns a response the frontend ActorGuard recognizes as success",
        "Calling initialize() when already initialized returns a value treated as a ready state by the frontend",
        "No stuck initialization state persists after canister deployment"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "Preserve the existing role-based access control and session/message data model in backend/main.mo"
  ],
  "nonGoals": [
    "Adding new features or changing the app's visual design",
    "Modifying authentication flow beyond what is needed to fix the ready state detection"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}