{
  "kind": "build_request",
  "title": "Fix landing page generation in llmService and wire it to the app",
  "projectName": "Noventra.Ai",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the landing page project type flow so that when a user selects 'Landing Page' in NewSessionPage and sends a message in ChatPage, the llmService returns a complete, working landing page scaffold (HTML structure, hero section, features, CTA, and styles) instead of failing silently or producing no output.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "it did work but not able to create landing page"
        ]
      },
      "acceptanceCriteria": [
        "Selecting 'Landing Page' as project type and submitting a prompt in ChatPage produces a non-empty AI response with code files.",
        "The llmService landing page template returns at least one code file (e.g., index.html or App.tsx) with a complete landing page scaffold.",
        "The generated response includes a hero section, a features/highlights section, and a call-to-action.",
        "No console errors or blank responses occur when the landing page project type is used."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the landing page template in llmService.ts generates a visually polished scaffold that matches Noventra.Ai's dark theme (OKLCH color tokens, glassmorphism, Space Grotesk font) and includes sections: Hero, Features, How It Works, and CTA with appropriate copy about Noventra.Ai building any project app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Make a landing page for noventra.AI informing it is app can make any project app mobile app or landing p..."
        ]
      },
      "acceptanceCriteria": [
        "The landing page template output contains Hero, Features, How It Works, and CTA sections.",
        "Copy reflects that Noventra.Ai can generate any project type: full-stack apps, mobile apps, and landing pages.",
        "Styles reference the existing dark theme color tokens and Space Grotesk font.",
        "The generated scaffold is valid, renderable code."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/ (immutable paths).",
    "Do not modify frontend/src/main.tsx.",
    "Do not modify frontend/src/components/ui.",
    "Keep all backend logic in backend/main.mo — no backend changes are needed for this fix."
  ],
  "nonGoals": [
    "Adding external API calls or live AI model integrations to llmService.",
    "Changing the backend canister or session management logic.",
    "Modifying the authentication flow.",
    "Creating a new route or page beyond what already exists."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}