{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Noventra App Startup and Launch Issues",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Diagnose and fix app startup/launch issues in ActorGuard, useActor.ts, and InternetIdentityProvider bootstrap sequence to ensure successful mounting without hanging or permanent loading state",
      "acceptanceCriteria": [
        "The app loads and renders without hanging on the ActorGuard loading screen",
        "The ICP actor initializes successfully on page load (both authenticated and anonymous)",
        "No console errors related to actor initialization or identity provider on startup",
        "The home/landing page is reachable within a reasonable time after page load",
        "Retry mechanism in ActorGuard works correctly if actor initialization is slow"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ActorGuard.tsx",
          "operation": "modify",
          "description": "Review and fix the ActorGuard loading logic to prevent infinite hanging. Ensure the retry mechanism triggers correctly after the 4-second timeout. Add fallback rendering logic to handle edge cases where the actor never initializes. Improve error boundary handling to catch actor initialization failures and display actionable error messages instead of an indefinite loading state."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Audit the ActorGuard placement and ensure it wraps only the necessary router components. Verify that QueryClient and ThemeProvider initialization does not block ActorGuard from rendering. Add error boundary wrapping around ActorGuard to catch and display initialization errors. Ensure AudioContext initialization does not interfere with actor bootstrap."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Audit and fix TanStack Router route setup to ensure all four routes resolve correctly on initial navigation and hard refresh, confirming the ProfileSetup guard does not block rendering in error states",
      "acceptanceCriteria": [
        "All four routes are accessible without 404 or blank screen on direct navigation",
        "Hard-refreshing any route loads the correct page",
        "The ProfileSetup guard only triggers when a profile is genuinely missing, not on every load",
        "No routing errors appear in the console on startup"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Audit the TanStack Router configuration for all four routes (home, sessions, new session, chat). Verify route definitions, paths, and component mappings are correct. Review the AppLayout ProfileSetup guard logic to ensure it only triggers when a profile is genuinely missing (userProfile === null and isFetched === true). Add guards to prevent the ProfileSetup modal from flashing on every load by checking both actor availability and profile fetch completion. Ensure the router does not block on authentication state changes. Verify hard-refresh behavior by testing route resolution with empty query cache."
        },
        {
          "path": "frontend/src/components/ProfileSetup.tsx",
          "operation": "modify",
          "description": "Review the ProfileSetup component's conditional rendering logic to prevent premature display before the user profile query completes. Ensure the component only shows when isAuthenticated is true, actor is available, profile is null, and isFetched is true. Add console logging for debugging profile fetch state during startup."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure the backend actor is reachable on app startup by verifying canister ID configuration and that anonymous/authenticated calls do not fail silently during initialization",
      "acceptanceCriteria": [
        "The frontend successfully connects to the backend canister on startup",
        "Canister ID is correctly resolved in both local and production environments",
        "Query calls made during initialization return valid responses or clear error messages"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add startup diagnostics to verify the backend actor is reachable. Log the canister ID being used during actor initialization. Add a test query call (e.g., getCallerUserRole) in a useEffect after actor initialization to confirm connectivity. Display clear error messages if the backend is unreachable, including environment detection (local vs production) and canister ID validation. Ensure the ActorGuard shows actionable error messages if the backend connection fails."
        }
      ]
    }
  ]
}